{
  "backend/main.mo": "Motoko actor defining Dealer and Inquiry types, storing a hardcoded list of 4 dealers, and exposing query functions to filter dealers by city/state plus a shared function to submit contact inquiries.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (visual theme, hero section, vehicle catalog, dealer locator) to their source files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "JSON dictionary providing one-sentence descriptions of each frontend source file, serving as a quick reference for the purpose of every component, hook, and stylesheet.",
  "frontend/index.css": "Base Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark color themes including background, foreground, border, and chart colors.",
  "frontend/index.html": "Minimal HTML shell for the React SPA, setting the page title to 'SML Mahindra Website Redesign' and mounting the app at the #root div.",
  "frontend/src/App.tsx": "Root React component that composes all page sections (Navbar, Hero, VehicleCatalog, DealerLocator, AboutSection, ContactForm, Footer) with a dark background and a Sonner toast provider.",
  "frontend/src/components/AboutSection.tsx": "Renders a company history section with a 6-entry alternating timeline of milestones and a 6-item core values icon grid against a textured dark background.",
  "frontend/src/components/ContactForm.tsx": "Contact section with a React Hook Form-powered inquiry form (name, email, phone, subject dropdown, message) that submits to the backend mutation and shows success/error toasts.",
  "frontend/src/components/DealerCard.tsx": "Presentational card component displaying a single dealer's name, city/state badge, address, phone (as a tel link), and a Google Maps directions link with amber hover styling.",
  "frontend/src/components/DealerLocator.tsx": "Renders a dealer locator section that fetches all dealers via a query hook and filters them client-side by city, state, name, or address using a search input. Handles loading, error, and empty states, and displays results as DealerCard components.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with brand info, social media links (LinkedIn, X, YouTube), quick navigation links with smooth scroll, and contact details. Displays a bottom bar with copyright year and a credit link.",
  "frontend/src/components/Hero.tsx": "Full-screen hero section with a background image, animated headline, tagline, CTA buttons to scroll to vehicles or dealers, and a stats bar showing key brand metrics.",
  "frontend/src/components/Navbar.tsx": "Fixed navigation bar that becomes opaque on scroll, with desktop nav links and a mobile hamburger menu that opens a full-screen overlay. Supports smooth scrolling to page sections.",
  "frontend/src/components/VehicleCard.tsx": "Displays a single vehicle as a card with its image, category badge, name, tagline, key specs (payload and fuel type), and a 'View Details' button that triggers a callback.",
  "frontend/src/components/VehicleCatalog.tsx": "Renders the vehicle catalog section with a static list of six vehicles (buses, trucks, LCVs), category filter buttons, and a grid of VehicleCard components. Opens a VehicleDetailModal when a card's details button is clicked.",
  "frontend/src/components/VehicleDetailModal.tsx": "A modal dialog component that displays detailed vehicle information including an image header, category badge, and a specs grid with icons. Includes a CTA button that closes the modal and scrolls to the contact section.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status to child components.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching dealers (all, by city, by state) and submitting inquiries via the ICP backend actor.",
  "frontend/src/index.css": "Global CSS file that imports Google Fonts, sets up Tailwind layers, defines CSS custom properties for the design system (amber, charcoal, steel tokens), and adds utility classes and animations.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with custom brand colors (amber, charcoal, steel), fonts (Inter, Barlow Condensed), shadows, border radii, and keyframe animations, plus typography and container-queries plugins.",
  "project_state.json": "Defines the project state for a modern redesign of the SML Mahindra website, including architectural notes, required images, and a list of existing features covering visual theme, hero section, vehicle catalog, dealer locator, and more."
}